# SteelElemBoltGripLengthIncrease Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemBoltGripLengthIncrease Property
ParameterTypeId Class See Also
---
"Grip Length Increase"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemBoltGripLengthIncrease { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemBoltGripLengthIncrease As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemBoltGripLengthIncrease {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace